app/views/book_lists/show.html.erb

SELECT `courses`.* FROM `courses` WHERE `courses`.`book_list_id` = 1
---
<h2> Courses: </h2>
<%@book_list.courses.each do |course| %>