app/views/courses/show.html.erb

<h2>Books </h2>
<%@course.books.each do |book| %>
---
SELECT `books`.* FROM `books` WHERE `books`.`course_id` = 1