app/controllers/book_lists_controller.rb

SELECT `book_lists`.* FROM `book_lists`
---
  def index
    @book_lists = BookList.all

SELECT `courses`.* FROM `courses` WHERE `courses`.`book_list_id` = 1
SELECT `books`.* FROM `books` WHERE `books`.`course_id` = 2
---
  def string_generator
    @entries = ""
    @book_lists.each { |book_list|
      book_list.courses.each { |course|
        department = course.department
        course_number = course.number
        course.books.each { |book|

INSERT INTO `book_lists` (`term_id`, `created_at`, `updated_at`) VALUES (1, '2018-05-29 19:17:21', '2018-05-29 19:17:21')
---
  def create
    @book_list = BookList.new(book_list_params)

    respond_to do |format|
      if @book_list.save

SELECT  `book_lists`.* FROM `book_lists` WHERE `book_lists`.`id` = 1 LIMIT 1
---
    def set_book_list
      @book_list = BookList.find(params[:id])