app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`instructors`, `sections`, `department`, `number`, `term`, `book_list_id`, `created_at`, `updated_at`) VALUES ('123', '123', '11', 11, '1', 1, '2018-05-30 15:50:38', '2018-05-30 15:50:38')

  def destroy
    @course.destroy
---
DELETE FROM `courses` WHERE `courses`.`id` = 1

    def set_course
      @course = Course.find(params[:id])
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1