app/controllers/terms_controller.rb

  def index
    @terms = Term.all
---
SELECT `terms`.* FROM `terms`

  def create
    @term = Term.new(term_params)

    respond_to do |format|
      if @term.save
---
INSERT INTO `terms` (`term_code`, `term_description`, `created_at`, `updated_at`) VALUES (11, '11', '2018-05-29 18:54:09', '2018-05-29 18:54:09')

    def set_term
      @term = Term.find(params[:id])
---
SELECT  `terms`.* FROM `terms` WHERE `terms`.`id` = 3 LIMIT 1